#### IFCTransformSetter Members

---

|  |
| --- |
| IFCTransformSetter Class   Methods   Properties   See Also |

The  IFCTransformSetter  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of a transform setter. |
| Public method | Dispose | Releases all resources used by the  IFCTransformSetter |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | Initialize | Initializes the transformation in the transform setter. |
| Public method | InitializeFromBoundingBox |  |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

IFCTransformSetter Class

Autodesk.Revit.DB.IFC Namespace